# 稳定版本，开始消融实验
# [通道数, 专家数量, TOPK, 共享专家数量, 直通专家数量, 模拟退火步长, 层数索引]
# V6.0: 将模块放到颈部，看看是否能提升性能


# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

ch: 6
# YOLOv8.0n backbone
# YOLO Dual-Modal MoE Architecture (Pure Backbone MoE)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]  # 0-P1/2
  - [0, 1, SilenceChannel, [0,3]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]] # 6

  - [0, 1, SilenceChannel, [3,6]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]] # 12

  - [[6, 12], 1, Concat, [1]]  # 13: cat backbone P3
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/16
  - [-1, 1, A2C2f, [512, True, 4]] # 15: P4 基础特征

  # 🎯 核心插入 1：在 P4 基础特征后，进行 MoE 模态解耦
  - [-1, 1, C2f_DualModal_MoE, [512, 4, 1, 1, 1, 520, "Backbone_P4"]] # 16: 输出特化后的 P4

  - [-1, 1, Conv, [1024, 3, 2]] # 17-P5/32 (从特化后的 16 层继续降采样)
  - [-1, 1, A2C2f, [1024, True, 1]] # 18: P5 基础特征

  # 🎯 核心插入 2：在 P5 基础特征后，进行 MoE 模态解耦
  - [-1, 1, C2f_DualModal_MoE, [1024, 4, 1, 1, 1, 520, "Backbone_P5"]] # 19: 输出特化后的 P5

# YOLO head (标准多尺度融合，不包含 MoE)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20: 放大特化后的 P5

  # 🚨 关键链接：提取 16 (MoE 处理后的 P4) 进行拼接
  - [[-1, 16], 1, Concat, [1]] # 21: cat backbone P4 (MoE Output)
  - [-1, 2, A2C2f, [512, False, -1]] # 22: 标准 P4 融合层

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 23: 放大融合后的 P4
  - [[-1, 13], 1, Concat, [1]] # 24: cat backbone P3 (P3 没有 MoE，接 13)
  - [-1, 2, A2C2f, [256, False, -1]] # 25: 标准 P3 融合层

  - [-1, 1, Conv, [256, 3, 2]] # 26: 降采样 P3
  - [[-1, 22], 1, Concat, [1]] # 27: cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 28: 标准 P4 融合层

  - [-1, 1, Conv, [512, 3, 2]] # 29: 降采样 P4

  # 🚨 关键链接：提取 19 (MoE 处理后的 P5) 进行拼接
  - [[-1, 19], 1, Concat, [1]] # 30: cat head P5 (MoE Output)
  - [-1, 2, C3k2, [1024, True]] # 31: 标准 P5 融合层

  # --- 最终检测头 ---
  - [[25, 28, 31], 1, Detect, [nc]] # 32: Detect(P3, P4, P5)
