# 稳定版本，开始消融实验
# [通道数, 专家数量, TOPK, 共享专家数量, 直通专家数量, 模拟退火步长, 层数索引]
# V7.0: 早期融合，颈部MOE


# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

ch: 6
# YOLOv8.0n backbone
# ================= Backbone =================
# Parameters
nc: 1 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

ch: 6

backbone:
  # ================= 分支 1 (Branch 1) =================
  - [-1, 1, Silence, []]           # 0-P1/2 (输入)
  - [0, 1, SilenceChannel, [0,3]]  # 1-P1/2
  - [-1, 1, Conv, [64, 3, 2]]      # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [256, 3, 2]]     # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 [Branch1_P3]
  - [-1, 1, Conv, [512, 3, 2]]     # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8 [Branch1_P4]
  - [-1, 1, Conv, [1024, 3, 2]]    # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10 [Branch1_P5]

  # ================= 分支 2 (Branch 2) =================
  - [0, 1, SilenceChannel, [3,6]]  # 11-P1/2
  - [-1, 1, Conv, [64, 3, 2]]      # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 13-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 14
  - [-1, 1, Conv, [256, 3, 2]]     # 15-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 16 [Branch2_P3]
  - [-1, 1, Conv, [512, 3, 2]]     # 17-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 18 [Branch2_P4]
  - [-1, 1, Conv, [1024, 3, 2]]    # 19-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 20 [Branch2_P5]

  # ================= 双流融合 (Cross-channel Fusion) =================
  # P3 融合 (普通融合降维)
  - [[6, 16], 1, Concat, [1]]      # 21: Concat(Branch1_P3, Branch2_P3) 此时通道数为 1024
  - [-1, 1, Conv, [512, 1, 1]]     # 22: [Fused_P3] 降维回 512

  # P4 融合 (MoE 深层对齐)
  - [[8, 18], 1, Concat, [1]]      # 23: Concat(Branch1_P4, Branch2_P4) 此时通道数为 1024
  - [-1, 1, C2f_DualModal_MoE, [512, 4, 1, 1, 1, 520, "Fused_P4"]] # 24: [Fused_P4] MoE 处理并输出 512 通道

  # P5 融合 (MoE 深层对齐)
  - [[10, 20], 1, Concat, [1]]     # 25: Concat(Branch1_P5, Branch2_P5) 此时通道数为 2048
  - [-1, 1, C2f_DualModal_MoE, [1024, 4, 1, 1, 1, 520, "Fused_P5"]] # 26: [Fused_P5] MoE 处理并输出 1024 通道

# ================= YOLO Head =================
head:
  # --- 自顶向下 (Top-Down) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 27
  - [[-1, 24], 1, Concat, [1]]     # 28: 拼接 Fused_P4 (第24层)
  - [-1, 2, C3k2, [512, False]]    # 29: Head_P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 30
  - [[-1, 22], 1, Concat, [1]]     # 31: 拼接 Fused_P3 (第22层)
  - [-1, 2, C3k2, [256, False]]    # 32: [Out_P3_Small]

  # --- 自底向上 (Bottom-Up) ---
  - [-1, 1, Conv, [256, 3, 2]]     # 33: 降采样 P3
  - [[-1, 29], 1, Concat, [1]]     # 34: 拼接 Head_P4 (第29层)
  - [-1, 2, C3k2, [512, False]]    # 35: [Out_P4_Medium]

  - [-1, 1, Conv, [512, 3, 2]]     # 36: 降采样 P4
  - [[-1, 26], 1, Concat, [1]]     # 37: 拼接 Fused_P5 (第26层)
  - [-1, 2, C3k2, [1024, True]]    # 38: [Out_P5_Large]

  # --- 最终检测头 ---
  - [[32, 35, 38], 1, Detect, [nc]] # 39: Detect(P3, P4, P5)