# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

ch: 6
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]           # 0-P1/2
  - [0, 1, SilenceChannel, [0,3]]  # 1-P1/2 (分支 1 开始)
  - [-1, 1, Conv, [64, 3, 2]]      # 2-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 3-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [256, 3, 2]]     # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 6 🌟 分支 1 的 P3 特征
  - [-1, 1, Conv, [512, 3, 2]]     # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8
  - [-1, 1, C2f_DualModal_MoE, [512, True, 1, 0.5, 4, 1, "9"]] # 9 🌟 分支 1 的 P4 特征
  - [-1, 1, Conv, [1024, 3, 2]]    # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 11 (注：P5特征图极小，建议把area size 4 改成 2 或 1，此处我帮你改为 2)
  - [-1, 1, C2f_DualModal_MoE, [1024, True, 1, 0.5, 4, 1, "12"]] # 12 🌟 分支 1 的 P5 特征

  - [0, 1, SilenceChannel, [3,6]]  # 13-P1/2 (分支 2 开始)
  - [-1, 1, Conv, [64, 3, 2]]      # 14-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 15-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 16
  - [-1, 1, Conv, [256, 3, 2]]     # 17-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 18 🌟 分支 2 的 P3 特征
  - [-1, 1, Conv, [512, 3, 2]]     # 19-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 20
  - [-1, 1, C2f_DualModal_MoE, [512, True, 1, 0.5, 4, 1, "21"]] # 21 🌟 分支 2 的 P4 特征
  - [-1, 1, Conv, [1024, 3, 2]]    # 22-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 23
  - [-1, 1, C2f_DualModal_MoE, [1024, True, 1, 0.5, 4, 1, "24"]] # 24 🌟 分支 2 的 P5 特征

  # ================= 双流融合 =================
  - [[6, 18], 1, Concat, [1]]  # 25 融合 P3 特征 (旧版是 6,16)
  - [[9, 21], 1, Concat, [1]]  # 26 融合 P4 特征 (旧版是 8,18)
  - [[12, 24], 1, Concat, [1]] # 27 融合 P5 特征 (旧版是 10,20)

# YOLO Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 28 (原 30)
  - [[-1, 26], 1, Concat, [1]] # 29 (原 31) - 拼接 P4
  - [-1, 2, C3k2, [512, False]] # 30 (原 32)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 31 (原 33)
  - [[-1, 25], 1, Concat, [1]] # 32 (原 34) - 拼接 P3
  - [-1, 2, C3k2, [256, False]] # 33 (原 35) -> 输出 P3

  - [-1, 1, Conv, [256, 3, 2]] # 34 (原 36)
  - [[-1, 30], 1, Concat, [1]] # 35 (原 37) - 拼接 Head P4
  - [-1, 2, C3k2, [512, False]] # 36 (原 38) -> 输出 P4

  - [-1, 1, Conv, [512, 3, 2]] # 37 (原 39)
  - [[-1, 27], 1, Concat, [1]] # 38 (原 40) 🌟 关键修改：直接拼接融合后的 P5 (层 27)
  - [-1, 2, C3k2, [1024, True]] # 39 (原 41) -> 输出 P5

  - [[33, 36, 39], 1, Detect, [nc]] # 40 (原 42)
